ContactAnglebottom4_0.01/constant/transportProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object transportProperties;
}

phases
  (
    water
    oil
  );

rhop rhop     [ 1 -3 0 0 0 0 0 ]     1000 ;

water
{
  transportModel Newtonian;
  nu nu       [ 0 2 -1 0 0 0 0 ]       1e-06 ;
  rho rho       [ 1 -3 0 0 0 0 0 ]       1000 ;
}

oil
{
  transportModel Newtonian;
  nu nu       [ 0 2 -1 0 0 0 0 ]       2e-05 ;
  rho rho       [ 1 -3 0 0 0 0 0 ]       1000 ;
}

sigma sigma     [ 1 0 -2 0 0 0 0 ]     0.08 ; 	// ************************************************************************* //

